<!-- add-pr-comment:add-pr-comment -->

Terraform Plan **Production**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.myec2vm[0] must be replaced
-/+ resource "aws_instance" "myec2vm" {
      ~ ami                                  = "ami-076c7acfc9e8ee57d" -> "ami-0588935a949f9ff17" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:778339273960:instance/i-0e1c3bea863ecbe90" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0e1c3bea863ecbe90" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0ec781a3c47a7542c" -> (known after apply)
      ~ private_dns                          = "ip-172-31-32-161.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.32.161" -> (known after apply)
      ~ public_dns                           = "ec2-3-85-75-89.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.85.75.89" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
-           "vpc-ssh-terragrunt-infracost",
-           "vpc-web-terragrunt-infracost",
        ] -> (known after apply)
+       spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-03bf92a6bf130e54e" -> (known after apply)
      ~ tags                                 = {
            "Environment" = "GithubActionsWorkflow"
          ~ "Name"        = "CI/CD_v2.2.2_0" -> "CI/CD_geewiz_0"
            "Service"     = "reusableWorkflow"
        }
      ~ tags_all                             = {
          ~ "Name"        = "CI/CD_v2.2.2_0" -> "CI/CD_geewiz_0"
            # (2 unchanged elements hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
+       user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 2 -> null
        }

-       credit_specification {
-           cpu_credits = "unlimited" -> null
        }

-       enclave_options {
-           enabled = false -> null
        }

-       maintenance_options {
-           auto_recovery = "default" -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_protocol_ipv6          = "disabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
-           instance_metadata_tags      = "disabled" -> null
        }

-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = false -> null
-           enable_resource_name_dns_aaaa_record = false -> null
-           hostname_type                        = "ip-name" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/xvda" -> null
-           encrypted             = false -> null
-           iops                  = 100 -> null
-           tags                  = {} -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-0c15c478f47868f27" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ for_output_map1                 = {
-       i-0e1c3bea863ecbe90 = "ec2-3-85-75-89.compute-1.amazonaws.com"
    } -> (known after apply)
  ~ for_output_map2                 = {
      ~ "0" = "ec2-3-85-75-89.compute-1.amazonaws.com" -> (known after apply)
    }
  ~ latest_splat_instance_publicdns = [
-       "ec2-3-85-75-89.compute-1.amazonaws.com",
+       (known after apply),
    ]
  ~ legacy_splat_instance_publicdns = [
-       "ec2-3-85-75-89.compute-1.amazonaws.com",
+       (known after apply),
    ]
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.myec2vm[0] must be replaced
-/+ resource "aws_instance" "myec2vm" {
      ~ ami                                  = "ami-076c7acfc9e8ee57d" -> "ami-0588935a949f9ff17" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:778339273960:instance/i-0e1c3bea863ecbe90" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0e1c3bea863ecbe90" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0ec781a3c47a7542c" -> (known after apply)
      ~ private_dns                          = "ip-172-31-32-161.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.32.161" -> (known after apply)
      ~ public_dns                           = "ec2-3-85-75-89.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.85.75.89" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "vpc-ssh-terragrunt-infracost",
          - "vpc-web-terragrunt-infracost",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-03bf92a6bf130e54e" -> (known after apply)
      ~ tags                                 = {
            "Environment" = "GithubActionsWorkflow"
          ~ "Name"        = "CI/CD_v2.2.2_0" -> "CI/CD_geewiz_0"
            "Service"     = "reusableWorkflow"
        }
      ~ tags_all                             = {
          ~ "Name"        = "CI/CD_v2.2.2_0" -> "CI/CD_geewiz_0"
            # (2 unchanged elements hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0c15c478f47868f27" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ for_output_map1                 = {
      - i-0e1c3bea863ecbe90 = "ec2-3-85-75-89.compute-1.amazonaws.com"
    } -> (known after apply)
  ~ for_output_map2                 = {
      ~ "0" = "ec2-3-85-75-89.compute-1.amazonaws.com" -> (known after apply)
    }
  ~ latest_splat_instance_publicdns = [
      - "ec2-3-85-75-89.compute-1.amazonaws.com",
      + (known after apply),
    ]
  ~ legacy_splat_instance_publicdns = [
      - "ec2-3-85-75-89.compute-1.amazonaws.com",
      + (known after apply),
    ]

```